#Средствами языка Python сформировать два текстовых файла (.txt), содержащих по одной
#последовательности из целых положительных и отрицательных чисел. Сформировать
#новый текстовый файл (.txt) следующего вида, предварительно выполнив требуемую
#обработку элементов:
#Элементы первого и второго - файлов:
#Элементы после сортировки:
#Количество элементов:
#Минимальный элемент кратный 2:
#Максимальный элемент кратный 5:

# Создаем список.
l1 = [' -99 ', ' 6 ', ' 12 ', ' -36 ', ' 20 ', ' 45 ', ' 100 ', ' -15 ']
f1 = open('chisla_1.txt', 'w', encoding='utf-8')
f1.write('Исходные данные:')
f1.write('\n')
f1.writelines(l1)
f1.close()

# Создаем второй список.
l2 = ['-555 ', ' 6 ', ' 92 ', ' -65 ', ' 34 ', ' 70 ', ' -255 ', ' 10 ']
f2 = open('chisla_2.txt', 'w', encoding='utf-8')
f2.write('Исходные данные:')
f2.write('\n')
f2.writelines(l2)
f2.close()

# Совмещаем два списка.
l3 = l1+l2
l4 = str(l3)
f3 = open('chisla_3.txt', 'w', encoding='utf-8')
f3.write("Элеметны первого и второго файлов: ")
f3.writelines(l4)
f3.close()

# Сортируем элеметны двух списков.
l5 = [ -99 ,  6 ,  12 ,  -36 ,  20 ,  45 ,  100 ,  -15 , -555 ,  6 ,  92 ,  -65 ,  34 ,  70 ,  -255 , 10 ]
l5.sort()
l5 = str(l5)
f3 = open('chisla_3.txt', 'a', encoding='utf-8')
f3.write("\nЭлеметны после сотрировки: ")
f3.writelines(l5)
f3.close()

# Считаем кол-во элементов списка l1
l1= [' -99 ', ' 6 ', ' 12 ', ' -36 ', ' 20 ', ' 45 ', ' 100 ', ' -15 ']
a = len(l1)
a = str(a)
f3 = open('chisla_3.txt', 'a', encoding='utf-8')
f3.write("\nКоличество элементов в списке: ")
f3.writelines(a)
f3.close()

# Минимальный элемент кратный 2.
l5 = [ -99 ,  6 ,  12 ,  -36 ,  20 ,  45 ,  100 ,  -15 , -555 ,  6 ,  92 ,  -65 ,  34 ,  70 ,  -255 , 10 ]
num1 = min(list(i for i in l5 if i > 0 and i % 2 == 0))
num1 = str(num1)
f3 = open('chisla_3.txt', 'a', encoding='utf-8')
f3.write("\nМинимальный элемет кратный 2: ",)
f3.writelines(num1)
f3.close()

# Максимальный элемент кратный 5.
l5 = [ -99 ,  6 ,  12 ,  -36 ,  20 ,  45 ,  100 ,  -15 , -555 ,  6 ,  92 ,  -65 ,  34 ,  70 ,  -255 , 10 ]
num2 = max(list(i for i in l5 if i > 0 and i % 5 == 0))
num2 = str(num2)
f3 = open('chisla_3.txt', 'a', encoding='utf-8')
f3.write("\nМаксимальный элемет кратный 2: ",)
f3.writelines(num2)
f3.close()