# Дана последовательность целых чисел. Поменять местами ее первую и последнюю трети.

# Первая последовательнось.
posled1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
print(posled1)

# Вторая последовательность.
posled2 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
posled2[0], posled2[1], posled2[2], posled2[9], posled2[10], posled2[11] = posled2[11], posled2[10], posled2[9], posled2[2], posled2[1], posled2[0]
print(posled2)